In [5]:
import numpy as np
import pandas as pd

csv = pd.read_csv('ex1.csv')
csv

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Quando o arquivo não há um cabeçalho, podemos criá-lo ou adicionar o parâmetro header=None.

In [11]:
csv2 = pd.read_csv('examples/ex2.csv', header=None)
csv2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [13]:
csv2 = pd.read_csv('examples/ex2.csv', names=['A','B','C','D'])
csv2

    A   B   C      D
1   2   3   4  hello
5   6   7   8  world
9  10  11  12    foo

Podemos ignorar linhas com skiprows:

In [18]:
csv3 = pd.read_csv('examples/ex3.csv', skiprows=[0,2,3])
csv3

   a  b   c   d      e
0  1  0   3   4  hello
1  5  6   7   8      0
2  9  0  11  12      0

Ao lidar com valores ausentes, o na_values é útil quando queremos considerar um valor como nulo:

In [19]:
csv3 = pd.read_csv('examples/ex3.csv', skiprows=[0,2,3], na_values=0)
csv3

   a    b   c   d      e
0  1  NaN   3   4  hello
1  5  6.0   7   8    NaN
2  9  NaN  11  12    NaN